import dynamic from "next/dynamic";

const Container = dynamic(() =>
  import("@mantine/core").then((mod) => mod.Container)
);
const Text = dynamic(() => import("@mantine/core").then((mod) => mod.Text));
const Title = dynamic(() => import("@mantine/core").then((mod) => mod.Title));

export default function GDPR() {
  return (
    <Container size="xl">
      <Title order={1} align="center" mb="md">
        Политика за защита на личните данни
      </Title>
      <Text align="justify" mb="md">
        ПОЛИТИКА ЗА ЗАЩИТА НА ЛИЧНИТЕ ДАННИ Задължителна информация за правата
        на лицата по защита на личните данни (Privacy Policy) Обща информация От
        25 май 2018г. влиза в сила нов регламент за защита на личните данни
        (General Data Protection Regulation), приет от Европейския съюз.
        Регламентът има за цел да гарантира защитата на данните на физическите
        лица от всички държави членки на ЕС и да уеднакви регулациите за тяхната
        обработка. В качеството си на администратор на лични данни &quot;Агро
        Експорт-Импорт&quot; ООД, отговаря на всички изисквания на новата
        регулация, като събира единствено данни на лицата дотолкова, доколкото
        са необходими за предоставянето на услугата, и ги пази отговорно и
        законосъобразно. Информация относно Администратора на лични данни 1.
        Наименование &quot;Агро Експорт-Импорт&quot; ООД 2. ЕИК : 103164689 3.
        Седалище и адрес на управление: гр. Варна, ул. &quot;Иван Аксаков&quot;
        № 26 4. Данни за кореспонденция: гр. Варна, ул. &quot;Орех&quot; №2 5.
        E-mail: agro_export@abv.bg Информация относно компетентния надзорен
        орган 1. Наименование: Комисия за защита на личните данни 2. Седалище и
        адрес на управление: гр. София 1592, бул. „Проф. Цветан Лазаров” № 2 3.
        Данни за кореспонденция: гр. София 1592, бул. „Проф. Цветан Лазаров” № 2
        4. Телефон:02 915 3 518 5. Email: kzld@government.bg, kzld@cpdp.bg 6.
        Уеб сайт: www.cpdp.bg &quot;Агро Експорт-Импорт&quot; ООД осъществява
        дейността си в съответствие със Закона за защита на личните данни и
        Регламент (ЕС) 2016/679 на Европейския парламент и на Съвета от 27 април
        2016 година относно защитата на физическите лица във връзка с
        обработването на лични данни и относно свободното движение на такива
        данни. Основание за събиране, обработване и съхраняване на Вашите лични
        данни Чл. 1. (1) &quot;Агро Експорт-Импорт&quot; ООД събира и обработва
        Вашите лични данни във връзка с търговската дейност въз основа на
        следното: ● Изпълнение на задълженията на &quot;Агро
        Експорт-Импорт&quot; ООД по договор с Вас; ● Изрично получено съгласие
        от Вас при запитване чрез сайта на &quot;Агро Експорт-Импорт&quot; ООД
        https://www.agro-export.com/ ● За целите на легитимния интерес на
        &quot;Агро Експорт-Импорт&quot; ООД. Цели и принципи при събирането,
        обработването и съхраняването на Вашите лични данни Чл. 2. (1)
        &quot;Агро Експорт-Импорт&quot; ООД събира и обработва личните данни,
        които Вие ни предоставяте във връзка с използването на нашите услуги и
        за сключване на договор с дружеството, както и за запитване чрез сайта
        на &quot;Агро Експорт-Импорт&quot; ООД, включително за следните цели: ●
        индивидуализация на страна по договора; ● счетоводни цели; ● защита на
        информационната сигурност; ● обезпечаване на изпълнението на договора за
        предоставяне на съответната услуга; (2) &quot;Агро Експорт-Импорт&quot;
        ООД спазва следните принципи при обработката на Вашите лични данни: ●
        законосъобразност, добросъвестност и прозрачност; ● ограничение на
        целите на обработване; ● съотносимост с целите на обработката и свеждане
        до минимум на събираните данни; ● точност и актуалност на данните; ●
        ограничение на съхранението с оглед постигане на целите; ● цялостност и
        поверителност на обработването и гарантиране на подходящо ниво на
        сигурност на личните данни. (3) При обработването и съхранението на
        личните данни, &quot;Агро Експорт-Импорт&quot; ООД може да обработва и
        съхранява личните данни с цел защита на следните си легитимни интереси:
        ● изпълнение на задълженията си към Национална агенция по приходите,
        Министерство на вътрешните работи и други държавни и общински органи.
        Какви видове лични данни събира, обработва и съхранява &quot;Агро
        Експорт-Импорт&quot; ООД? Чл. 3. (1) &quot;Агро Експорт-Импорт&quot; ООД
        извършва следните операции с личните данни за следните цели: ● Сключване
        и изпълнение на търговска сделка с клиент или партньор (2) &quot;Агро
        Експорт-Импорт&quot; ООД обработва следните категории лични данни и
        информация за следните цели и на следните основания: ● Данни: Ваши
        индивидуализиращи данни: Имена по лична карта или паспорт, ЕГН/ЛНЧ,
        гражданство, номер на лична карта/валиден национален документ за
        самоличност, адрес, имейл и телефон. ○ Цел, за която се събират данните:
        1) изпълнение на договор с търговски партньор и неговото администриране;
        ○ Основание за обработка на личните Ви данни – договорно основание ●
        Допълнителни данни, предоставяни от Вас – Ако желаете да направите
        запитване за чрез сайта на &quot;Агро Експорт-Импорт&quot; ООД:
        https://www.agro-export.com/contacts/, трябва да попълните онлайн
        формуляр които изисква: име, фамилия, имейл и телефон. ○ Цел, за която
        се събират данните: Запитване за информация относно дейностите и
        услугите на &quot;Агро Експорт-Импорт&quot; ООД. ○ Основания за
        обработка на данните: С приемането на общите условия и политиката за
        защита на личните данни на уебсайта Вие давате ясно изразено съгласие
        личните ви данни да бъдат обработени за съответната цел. ● Други данни,
        които &quot;Агро Експорт-Импорт&quot; ООД обработва – При влизане в
        нашия уебсайт, &quot;Агро Експорт-Импорт&quot; ООД събира данни за
        използвания IP адрес. ○ Цел, за която се събират данните: Подобряване на
        сигурността на услугата и локализация на интерфейса, статистически и
        маркетингови проучвания. ○ Основания за обработка на данните: IP адресът
        се събира на основание осъществяване на легитимните интереси на
        администратора – чл. 6, ал. 1, б. (е) от GDPR; ● Ваши данни за
        издаването на фактура на физическо лице – Ако желаете да Ви бъде
        издадена фактура в качеството Ви на физическо лице, следва да
        предоставите своя единен граждански номер. ○ Цел, за която се събират
        данните: Издаване на фактура за извършване на плащания по сключен
        договор за предоставяне на услуги. ○ Основание за обработка на личните
        Ви данни – При сключването на писмен договор, между &quot;Агро
        Експорт-Импорт&quot; ООД и Вас се създава договорно отношение, на което
        основание обработваме Вашите лични данни – чл. 6, ал. 1, б. (б) GDPR.
        (3) &quot;Агро Експорт-Импорт&quot; ООД не събира и не обработва лични
        данни, които се отнасят за следното: ● разкриват расов или етнически
        произход; ● разкриват политически, религиозни или философски убеждения,
        или членство в синдикални организации; ● генетични и биометрични данни,
        данни за здравословното състояние или данни за сексуалния живот или
        сексуалната ориентация. (4) Личните данни са събрани от &quot;Агро
        Експорт-Импорт&quot; ООД от лицата, за които се отнасят. (5) Дружеството
        не извършва автоматизирано взимане на решения с данни. Срок на
        съхранение на личните Ви данни Чл. 4. (1) &quot;Агро
        Експорт-Импорт&quot; ООД съхранява Вашите лични данни за срок не
        по-дълъг от изискванията на приложимото законодателство за съответния
        предвиден срок. След изтичането на този срок, &quot;Агро
        Експорт-Импорт&quot; ООД полага необходимите грижи да изтрие и унищожи
        всички Ваши данни, без ненужно забавяне. (2) &quot;Агро
        Експорт-Импорт&quot; ООД Ви уведомява, в случай, че срокът за съхранение
        на данните е необходимо да бъде удължен с оглед изпълнение на целите,
        изпълнение на договора, с оглед легитимни интереси на &quot;Агро
        Експорт-Импорт&quot; ООД или друго. Предаване на вашите лични данни за
        обработване Чл. 5. (1) &quot;Агро Експорт-Импорт&quot; ООД може по
        собствена преценка да предава част или всички Ваши лични данни на
        обработващи лични данни за изпълнението на целите за обработване при
        спазване на изискванията на Регламент (ЕС) 2016/679. (2) &quot;Агро
        Експорт-Импорт&quot; ООД Ви уведомява в случай на намерение да предаде
        част или всички Ваши лични данни на трети държави или международни
        организации. Вашите права при събирането, обработването и съхранението
        на личните ви данни Оттегляне на съгласието за обработване на личните Ви
        данни Чл. 6. (1) Ако не желаете всички или част от Вашите лични данни да
        продължат да бъдат обработвани от &quot;Агро Експорт-Импорт&quot; ООД за
        конкретна или за всички цели на обработване, Вие можете по всяко време
        да оттеглите съгласието си за обработка чрез попълване на онлайн
        формуляр или чрез искане в свободен текст. (2) &quot;Агро
        Експорт-Импорт&quot; ООД може да поиска да удостоверите своята
        самоличност и идентичност с лицето, за което се отнасят данните. Право
        на достъп Чл. 7. (1) Вие имате право да изискате и получите от
        &quot;Агро Експорт-Импорт&quot; ООД потвърждение дали се обработват
        лични данни, свързани с Вас. (2) Вие имате право да получите достъп до
        данните, свързани с него, както и до информацията, отнасяща се до
        събирането, обработването и съхранението на личните Ви данни. (3)
        &quot;Агро Експорт-Импорт&quot; ООД Ви предоставя при поискване, копие
        от обработваните лични данни, свързани с Вас, в електронна или друга
        подходяща форма. (4) Предоставянето на достъп до данните е безплатно, но
        &quot;Агро Експорт-Импорт&quot; ООД си запазва правото да наложи
        административна такса, в случай на повторяемост или прекомерност на
        исканията. Право на коригиране или попълване Чл. 8. Вие можете да
        коригирате или попълните неточните или непълните лични данни, свързани с
        Вас с отправяне на искане до &quot;Агро Експорт-Импорт&quot; ООД. Право
        на изтриване („да бъдеш забравен“) Чл. 9.(1) Вие имате правото да
        поискате от &quot;Агро Експорт-Импорт&quot; ООД изтриване на свързаните
        с Вас лични данни, а &quot;Агро Експорт-Импорт&quot; ООД има
        задължението да ги изтрие без ненужно забавяне, когато е налице някое от
        посочените по-долу основания: ● личните данни повече не са необходими за
        целите, за които са били събрани или обработвани по друг начин; ● Вие
        оттеглите своето съгласие, върху което се основава обработването на
        данните и няма друго правно основание за обработването; ● Вие възразите
        срещу обработването на свързаните с Вас лични данни, включително за
        целите на директния маркетинг и няма законни основания за обработването,
        които да имат преимущество; ● личните данни са били обработвани
        незаконосъобразно; ● личните данни трябва да бъдат изтрити с цел
        спазването на правно задължение по правото на ЕС или правото на държава
        членка, което се прилага спрямо &quot;Агро Експорт-Импорт&quot; ООД; ●
        личните данни са били събрани във връзка с предлагането на услуги на
        информационното общество. (2) &quot;Агро Експорт-Импорт&quot; ООД не е
        длъжен да изтрие личните данни, ако ги съхранява и обработва: ● за
        упражняване на правото на свобода на изразяването и правото на
        информация; ● за спазване на правно задължение, което изисква
        обработване, предвидено в правото на ЕС или правото на държавата членка,
        което се прилага спрямо Администратора или за изпълнението на задача от
        обществен интерес или при упражняването на официални правомощия, които
        са му предоставени; ● по причини от обществен интерес в областта на
        общественото здраве; ● за целите на архивирането в обществен интерес, за
        научни или исторически изследвания или за статистически цели; ● за
        установяването, упражняването или защитата на правни претенции. (3) За
        да упражните правото си на „забравяне“, Вие следва да подадете писмено
        искане, изпратено до &quot;Агро Експорт-Импорт&quot; ООД, както и да
        удостоверите своята самоличност и идентичност с лицето, за което се
        отнасят данните, като представите на място своята лична карта за целите
        на идентификация (4) &quot;Агро Експорт-Импорт&quot; ООД не изтрива
        данните, които има законово задължение да съхранява, включително за
        защита по повод отправени срещу него съдебни претенции или доказване на
        свои права. Право на ограничаване Чл. 10. Вие имате право да изискате от
        &quot;Агро Експорт-Импорт&quot; ООД да ограничи обработването на
        свързаните с Вас данни, когато: ● оспорите точността на личните данни,
        за срок, който позволява на &quot;Агро Експорт-Импорт&quot; ООД да
        провери точността на личните данни; ● обработването е неправомерно, но
        Вие не желаете личните Ви данни да бъдат изтрити, а само използването им
        да бъде ограничено; ● &quot;Агро Експорт-Импорт&quot; ООД не се нуждае
        повече от личните данни за целите на обработването, но Вие ги изисквате
        за установяването, упражняването или защитата на свои правни претенции;
        ● Възразили сте срещу обработването в очакване на проверка дали
        законните основания на &quot;Агро Експорт-Импорт&quot; ООД имат
        преимущество пред Вашите интереси. Право на преносимост Чл. 11. (1) Вие
        можете по всяко време да изтеглите данните, които се съхраняват и
        обработват за Вас във връзка с използване на услугите на &quot;Агро
        Експорт-Импорт&quot; ООД, с искане по имейл. (2) Вие можете да поискате
        от &quot;Агро Експорт-Импорт&quot; ООД директно да прехвърли Вашите
        лични данни към посочен от Вас администратор, когато това е технически
        осъществимо. Право на получаване на информация Чл. 12. Вие можете да
        поискате от &quot;Агро Експорт-Импорт&quot; ООД да Ви информира относно
        всички получатели, на които личните данни, за които е поискано
        коригиране, изтриване или ограничаване на обработването, са били
        разкрити. &quot;Агро Експорт-Импорт&quot; ООД може да откаже да
        предостави тази информация, ако това би било невъзможно или изисква
        несъразмерно големи усилия. Право на възражение Чл. 13. Вие можете да
        възразите по всяко време срещу обработването на лични данни от
        &quot;Агро Експорт-Импорт&quot; ООД, които се отнасят до Вас,
        включително ако се обработват за целите на профилиране или директен
        маркетинг. Вашите права при нарушение на сигурността на личните ви данни
        Чл. 14. (1) Ако &quot;Агро Експорт-Импорт&quot; ООД установи нарушение
        на сигурността на личните Ви данни, което може да породи висок риск за
        Вашите права и свободи, ние Ви уведомяваме без ненужно забавяне за
        нарушението, както и за мерките, които са предприети или предстои да
        бъдат предприети. (2) &quot;Агро Експорт-Импорт&quot; ООД не е длъжен да
        Ви уведомява, ако: ● е предприел подходящи технически и организационни
        мерки за защита по отношение на данните, засегнати от нарушението на
        сигурността; ● е взел впоследствие мерки, които гарантират, че
        нарушението няма да доведе до висок риск за правата Ви; ● уведомяването
        би изисквало непропорционални усилия. Лица, на които се предоставят
        личните ви данни Чл. 15. Администраторът не извършва трансфер на вашите
        данни към трети държави. Други разпоредби Чл. 16. В случай на нарушаване
        на правата Ви съгласно горепосоченото или приложимото законодателство за
        защита на личните данни, имате право да подадете жалба до Комисията за
        защита на личните данни, както следва: 1. Наименование: Комисия за
        защита на личните данни 2. Седалище и адрес на управление: гр. София
        1592, бул. „Проф. Цветан Лазаров” № 2 3. Данни за кореспонденция: гр.
        София 1592, бул. „Проф. Цветан Лазаров” № 2 4. Телефон:02 915 3 518 5.
        Email: kzld@government.bg, kzld@cpdp.bg 6. Уеб сайт: www.cpdp.bg Чл. 17.
        Можете да упражните всичките си права относно защита на Вашите лични
        данни чрез формите, приложени към настоящата информация. Разбира се,
        тези форми не са задължителни и можете да отправите исканията си във
        всякаква форма, която съдържа изявление за това и ви идентифицира като
        притежател на данните. Чл. 18. Ако съгласието се отнася за трансфер,
        Администраторът описва възможните рискове за трансфера на данните към
        трети държави при липсата на решение за адекватна защита и подходящи
        средства за защита.
      </Text>
    </Container>
  );
}